examples/supersonic_wedge/of_polymesh/0/Co
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Co;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
5625
(
52063.15
52063.15
52063.15
52063.15
52063.15
52063.15
52063.15
52063.15
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    sym
    {
        type            zeroGradient;
    }
    wedge
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
