examples/supersonic_wedge/of_polymesh/0/K
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 542114.3176;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 542114.3176;
    }
    sym
    {
        type            calculated;
        value           uniform 542114.3176;
    }
    wedge
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
478689.8299
478689.8299
478689.8299
478689.8299
478689.8299
478689.8299
478689.8299
478689.8299
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 542114.3176;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           uniform 542114.3176;
    }
}


// ************************************************************************* //
