examples/supersonic_wedge/of_polymesh/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }
    sym
    {
        type            slip;
    }
    wedge
    {
        type            slip;
    }
    top
    {
        type            slip;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
}


// ************************************************************************* //
