examples/supersonic_wedge/of_polymesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1041.263 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1041.263 0 0);
    }
    sym
    {
        type            slip;
    }
    wedge
    {
        type            slip;
    }
    top
    {
        type            slip;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (1041.263 0 0);
        value           uniform (1041.263 0 0);
    }
}


// ************************************************************************* //
