examples/supersonic_wedge/of_polymesh/0/Ux
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 1041.263;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1041.263;
    }
    sym
    {
        type            calculated;
        value           uniform 1041.263;
    }
    wedge
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
919.4407751
919.4407751
919.4407751
919.4407751
919.4407751
919.4407751
919.4407751
919.4407751
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 1041.263;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           uniform 1041.263;
    }
}


// ************************************************************************* //
