examples/supersonic_wedge/of_polymesh/0/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volTensorField;
    location    "0";
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<tensor> 
5625
(
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    sym
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    wedge
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
50
(
(-4445.107034 12211.83251 0 12211.83251 -33548.99042 0 0 0 0)
(-4466.838741 12271.535 0 12271.535 -33713.00825 0 0 0 0)
(-4488.78398 12331.82412 4.178184532e-15 12331.82412 -33878.6377 -1.147852893e-14 4.178184532e-15 -1.147852893e-14 -3.889076878e-33)
(-4510.945915 12392.70856 -4.198812982e-15 12392.70856 -34045.90263 1.15352005e-14 -4.198812982e-15 1.15352005e-14 -3.90827795e-33)
(-4533.327769 12454.19717 -4.219646133e-15 12454.19717 -34214.82738 1.159243443e-14 -4.219646133e-15 1.159243443e-14 -3.927669561e-33)
(-4555.932833 12516.29899 0 12516.29899 -34385.43679 0 0 0 0)
(-4578.764464 12579.02325 -4.261938856e-15 12579.02325 -34557.75619 1.170862323e-14 -4.261938856e-15 1.170862323e-14 -3.967035857e-33)
(-4601.826083 12642.37935 -4.283404736e-15 12642.37935 -34731.8114 1.176759543e-14 -4.283404736e-15 1.176759543e-14 -3.987016415e-33)
...
)
;
    }
    top
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
75
(
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
75
(
(0 0 0 0 0 7.462408475e-15 0 0 -2.528362338e-33)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
...
)
;
    }
}


// ************************************************************************* //
