examples/supersonic_wedge/of_polymesh/0/magSqr(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      magSqr(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1084228.635;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1084228.635;
    }
    sym
    {
        type            calculated;
        value           uniform 1084228.635;
    }
    wedge
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
957379.6598
957379.6598
957379.6598
957379.6598
957379.6598
957379.6598
957379.6598
957379.6598
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 1084228.635;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           uniform 1084228.635;
    }
}


// ************************************************************************* //
