examples/supersonic_wedge/of_polymesh/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 101325;
    }
    sym
    {
        type            slip;
    }
    wedge
    {
        type            slip;
    }
    top
    {
        type            slip;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
