examples/supersonic_wedge/of_polymesh/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1.173974399;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1.173974399;
    }
    sym
    {
        type            calculated;
        value           uniform 1.173974399;
    }
    wedge
    {
        type            calculated;
        value           uniform 1.173974399;
    }
    top
    {
        type            calculated;
        value           uniform 1.173974399;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           uniform 1.173974399;
    }
}


// ************************************************************************* //
