examples/supersonic_wedge/of_polymesh/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
5625
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    sym
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    wedge
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(0 -0 -1.818989404e-12)
(0 -0 -3.637978807e-12)
(0 -0 -1.818989404e-12)
(0 -0 0)
(3.155443621e-30 1.57772181e-30 0)
(0 -0 -3.637978807e-12)
(3.155443621e-30 1.57772181e-30 3.637978807e-12)
(4.733165431e-30 2.366582716e-30 0)
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
75
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
75
(
(7.462408475e-15 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;
    }
}


// ************************************************************************* //
