examples/supersonic_wedge/of_polymesh/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.01;
	minIter 	2;
    }

/*
    p
    {
        solver           	GAMG;
        tolerance        	1e-6;
        relTol           	0.01;
        smoother         	GaussSeidel;
        nPreSweeps       	0;
        nPostSweeps      	2;
        cacheAgglomeration 	on;
        agglomerator     	faceAreaPair;
        nCellsInCoarsestLevel 	100;
        mergeLevels      	1;
	minIter 		3;
    }
*/

    pFinal
    {
        $p;
        relTol          0;
	minIter 	2;
    }

    "U.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
	minIter 	2;
    }

/*
    "U.*"
    {
        type            coupled;
        solver          PBiCCCG;
        preconditioner  DILU;
        tolerance       (1e-08 1e-08 1e-08);
        relTol          (0 0 0);
	minIter 	2;
    }
*/

    "h.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
	minIter 	2;
    }

    "rho.*"
    {
        solver		diagonal;
    }
}

PIMPLE
{
    momentumPredictor 		yes;
    consistent			yes;

    nOuterCorrectors 		2;	//1-2-2
    nCorrectors    	 	3;	//3-3-2
    nNonOrthogonalCorrectors 	2;	//1-1-1

    transonic 			yes;

    maxCo             		0.5;		//0.9 (D)
    rDeltaTSmoothingCoeff 	0.1;		//0.1
    rDeltaTDampingCoeff 	0.5;		//0.9
    maxDeltaT         		0.001;

/*
    //Old way - Now in fvConstraints
    pMin          10000;
    pMax          1000000;
    //pMinFactor      0.5;
    //pMaxFactor      2.0;
*/

}


relaxationFactors
{
    fields
    {
        ".*" 0.9;
    }
    equations
    {
        ".*" 0.9;
    }
}

// ************************************************************************* //
